{
  "1.1a": {
    "description": "Identify concepts, derived from theories from nursing and other disciplines, which distinguish the practice of nursing.",
    "level": "Entry-Level"
  },
  "1.1b": {
    "description": "Apply knowledge of nursing science that develops a foundation for nursing practice.",
    "level": "Entry-Level"
  },
  "1.1c": {
    "description": "Understand the historical foundation of nursing as the relationship developed between the individual and nurse.",
    "level": "Entry-Level"
  },
  "1.1d": {
    "description": "Articulate nursing’s distinct perspective to practice.",
    "level": "Entry-Level"
  },
  "1.1e": {
    "description": "Translate evidence from nursing science as well as other sciences into practice.",
    "level": "Advanced"
  },
  "1.1f": {
    "description": "Demonstrate the application of nursing science to practice.",
    "level": "Advanced"
  },
  "1.1g": {
    "description": "Integrate an understanding of nursing history in advancing nursing’s influence in health care.",
    "level": "Advanced"
  },
  "1.2a": {
    "description": "Apply or employ knowledge from nursing science as well as the natural, physical, and social sciences to build an understanding of the human experience and nursing practice.",
    "level": "Entry-Level"
  },
  "1.2b": {
    "description": "Demonstrate intellectual curiosity.",
    "level": "Entry-Level"
  },
  "1.2c": {
    "description": "Demonstrate social responsibility as a global citizen who fosters the attainment of health equity for all.",
    "level": "Entry-Level"
  },
  "1.2d": {
    "description": "Examine influence of personal values in decision making for nursing practice.",
    "level": "Entry-Level"
  },
  "1.2e": {
    "description": "Demonstrate ethical decision making.",
    "level": "Entry-Level"
  },
  "1.2f": {
    "description": "Synthesize knowledge from nursing and other disciplines to inform education, practice, and research.",
    "level": "Advanced"
  },
  "1.2g": {
    "description": "Apply a systematic and defendable approach to nursing practice decisions.",
    "level": "Advanced"
  },
  "1.2h": {
    "description": "Employ ethical decision making to assess, intervene, and evaluate nursing care.",
    "level": "Advanced"
  },
  "1.2i": {
    "description": "Demonstrate socially responsible leadership.",
    "level": "Advanced"
  },
  "1.2j": {
    "description": "Translate theories from nursing and other disciplines to practice.",
    "level": "Advanced"
  },
  "1.3a": {
    "description": "Demonstrate clinical reasoning.",
    "level": "Entry-Level"
  },
  "1.3b": {
    "description": "Integrate nursing knowledge (theories, multiple ways of knowing, evidence) and knowledge from other disciplines and inquiry to inform clinical judgment.",
    "level": "Entry-Level"
  },
  "1.3c": {
    "description": "Incorporate knowledge from nursing and other disciplines to support clinical judgment.",
    "level": "Entry-Level"
  },
  "1.3d": {
    "description": "Integrate foundational and advanced specialty knowledge into clinical reasoning.",
    "level": "Advanced"
  },
  "1.3e": {
    "description": "Synthesize current and emerging evidence to Influence practice.",
    "level": "Advanced"
  },
  "1.3f": {
    "description": "Analyze decision models from nursing and other knowledge domains to improve clinical judgment.",
    "level": "Advanced"
  },
  "2.1a": {
    "description": "Demonstrate qualities of empathy.",
    "level": "Entry-Level"
  },
  "2.1b": {
    "description": "Demonstrate compassionate care.",
    "level": "Entry-Level"
  },
  "2.1c": {
    "description": "Establish mutual respect with the individual and family.",
    "level": "Entry-Level"
  },
  "2.1d": {
    "description": "Promote caring relationships to effect positive outcomes.",
    "level": "Advanced"
  },
  "2.1e": {
    "description": "Foster caring relationships.",
    "level": "Advanced"
  },
  "2.2a": {
    "description": "Demonstrate relationship-centered care.",
    "level": "Entry-Level"
  },
  "2.2b": {
    "description": "Consider individual beliefs, values, and personalized information in communications.",
    "level": "Entry-Level"
  },
  "2.2c": {
    "description": "Use a variety of communication modes appropriate for the context.",
    "level": "Entry-Level"
  },
  "2.2d": {
    "description": "Demonstrate the ability to conduct sensitive or difficult conversations.",
    "level": "Entry-Level"
  },
  "2.2e": {
    "description": "Use evidence-based patient teaching materials, considering health literacy, vision, hearing, and cultural sensitivity.",
    "level": "Entry-Level"
  },
  "2.2f": {
    "description": "Demonstrate emotional intelligence in communications.",
    "level": "Entry-Level"
  },
  "2.2g": {
    "description": "Demonstrate advanced communication skills and techniques using a variety of modalities with diverse audiences.",
    "level": "Advanced"
  },
  "2.2h": {
    "description": "Design evidence-based, person-centered engagement materials.",
    "level": "Advanced"
  },
  "2.2i": {
    "description": "Apply individualized information, such as genetic/genomic, pharmacogenetic, and environmental exposure information in the delivery of personalized health care.",
    "level": "Advanced"
  },
  "2.2j": {
    "description": "Facilitate difficult conversations and disclosure of sensitive information.",
    "level": "Advanced"
  },
  "2.3a": {
    "description": "Create an environment during assessment that promotes a dynamic interactive experience.",
    "level": "Entry-Level"
  },
  "2.3b": {
    "description": "Obtain a complete and accurate history in a systematic manner.",
    "level": "Entry-Level"
  },
  "2.3c": {
    "description": "Perform a clinically relevant, holistic health assessment.",
    "level": "Entry-Level"
  },
  "2.3d": {
    "description": "Perform point of care screening/diagnostic testing (e.g. blood glucose, PO2, EKG).",
    "level": "Entry-Level"
  },
  "2.3e": {
    "description": "Distinguish between normal and abnormal health findings.",
    "level": "Entry-Level"
  },
  "2.3f": {
    "description": "Apply nursing knowledge to gain a holistic perspective of the person, family, community, and population.",
    "level": "Entry-Level"
  },
  "2.3g": {
    "description": "Communicate findings of a comprehensive assessment.",
    "level": "Entry-Level"
  },
  "2.3h": {
    "description": "Demonstrate that one’s practice is informed by a comprehensive assessment appropriate to the functional area of advanced nursing practice.",
    "level": "Advanced"
  },
  "2.4a": {
    "description": "Synthesize assessment data in the context of the individual’s current preferences, situation, and experience.",
    "level": "Entry-Level"
  },
  "2.4b": {
    "description": "Create a list of problems/health concerns.",
    "level": "Entry-Level"
  },
  "2.4c": {
    "description": "Prioritize problems/health concerns.",
    "level": "Entry-Level"
  },
  "2.4d": {
    "description": "Understand and apply the results of social screening, psychological testing, laboratory data, imaging studies, and other diagnostic tests in actions and plans of care.",
    "level": "Entry-Level"
  },
  "2.4e": {
    "description": "Contribute as a team member to the formation and improvement of diagnoses.",
    "level": "Entry-Level"
  },
  "2.4f": {
    "description": "Employ context driven, advanced reasoning to the diagnostic and decision-making process.",
    "level": "Advanced"
  },
  "2.4g": {
    "description": "Integrate advanced scientific knowledge to guide decision making.",
    "level": "Advanced"
  },
  "2.5a": {
    "description": "Engage the individual and the team in plan development.",
    "level": "Entry-Level"
  },
  "2.5b": {
    "description": "Organize care based on mutual health goals.",
    "level": "Entry-Level"
  },
  "2.5c": {
    "description": "Prioritize care based on best evidence.",
    "level": "Entry-Level"
  },
  "2.5d": {
    "description": "Incorporate evidence-based intervention to improve outcomes and safety.",
    "level": "Entry-Level"
  },
  "2.5e": {
    "description": "Anticipate outcomes of care (expected, unexpected, and potentially adverse).",
    "level": "Entry-Level"
  },
  "2.5f": {
    "description": "Demonstrate rationale for plan.",
    "level": "Entry-Level"
  },
  "2.5g": {
    "description": "Address individuals’ experiences and perspectives in designing plans of care.",
    "level": "Entry-Level"
  },
  "2.5h": {
    "description": "Lead and collaborate with an interprofessional team to develop a comprehensive plan of care.",
    "level": "Advanced"
  },
  "2.5i": {
    "description": "Prioritize risk mitigation strategies to prevent or reduce adverse outcomes.",
    "level": "Advanced"
  },
  "2.5j": {
    "description": "Develop evidence-based interventions to improve outcomes and safety.",
    "level": "Advanced"
  },
  "2.5k": {
    "description": "Incorporate innovations into practice when evidence is not available.",
    "level": "Advanced"
  },
  "2.6a": {
    "description": "Implement individualized plan of care using established protocols.",
    "level": "Entry-Level"
  },
  "2.6b": {
    "description": "Communicate care delivery through multiple modalities.",
    "level": "Entry-Level"
  },
  "2.6c": {
    "description": "Delegate appropriately to team members.",
    "level": "Entry-Level"
  },
  "2.6d": {
    "description": "Monitor the implementation of the plan of care.",
    "level": "Entry-Level"
  },
  "2.6e": {
    "description": "Model best care practices to the team.",
    "level": "Advanced"
  },
  "2.6f": {
    "description": "Monitor aggregate metrics to assure accountability for care outcomes.",
    "level": "Advanced"
  },
  "2.6g": {
    "description": "Promote delivery of care that supports practice at the full scope of education.",
    "level": "Advanced"
  },
  "2.6h": {
    "description": "Contribute to the development of policies and processes that promote transparency and accountability.",
    "level": "Advanced"
  },
  "2.6i": {
    "description": "Apply current and emerging evidence to the development of care guidelines/tools.",
    "level": "Advanced"
  },
  "2.6j": {
    "description": "Ensure accountability throughout transitions of care across the health continuum.",
    "level": "Advanced"
  },
  "2.7a": {
    "description": "Reassess the individual to evaluate health outcomes/goals",
    "level": "Entry-Level"
  },
  "2.7b": {
    "description": "Modify plan of care as needed.",
    "level": "Entry-Level"
  },
  "2.7c": {
    "description": "Recognize the need for modifications to standard practice.",
    "level": "Entry-Level"
  },
  "2.7d": {
    "description": "Analyze data to identify gaps and inequities in care and monitor trends in outcomes.",
    "level": "Advanced"
  },
  "2.7e": {
    "description": "Monitor epidemiological and system-level aggregate data to determine healthcare outcomes and trends.",
    "level": "Advanced"
  },
  "2.7f": {
    "description": "Synthesize outcome data to inform evidencebased practice, guidelines, and policies.",
    "level": "Advanced"
  },
  "2.8a": {
    "description": "Assist the individual to engage in self-care management.",
    "level": "Entry-Level"
  },
  "2.8b": {
    "description": "Employ individualized educational strategies based on learning theories, methodologies, and health literacy.",
    "level": "Entry-Level"
  },
  "2.8c": {
    "description": "Educate individuals and families regarding selfcare for health promotion, illness prevention, and illness management.",
    "level": "Entry-Level"
  },
  "2.8d": {
    "description": "Respect individuals and families’ selfdetermination in their healthcare decisions.",
    "level": "Entry-Level"
  },
  "2.8e": {
    "description": "Identify personal, system, and community resources available to support self-care management.",
    "level": "Entry-Level"
  },
  "2.8f": {
    "description": "Develop strategies that promote self-care management.",
    "level": "Advanced"
  },
  "2.8g": {
    "description": "Incorporate the use of current and emerging technologies to support self-care management.",
    "level": "Advanced"
  },
  "2.8h": {
    "description": "Employ counseling techniques, including motivational interviewing, to advance wellness and self-care management.",
    "level": "Advanced"
  },
  "2.8i": {
    "description": "Evaluate adequacy of resources available to support self-care management.",
    "level": "Advanced"
  },
  "2.8j": {
    "description": "Foster partnerships with community organizations to support self-care management.",
    "level": "Advanced"
  },
  "2.9a": {
    "description": "Facilitate continuity of care based on assessment of assets and needs.",
    "level": "Entry-Level"
  },
  "2.9b": {
    "description": "Communicate with relevant stakeholders across health systems.",
    "level": "Entry-Level"
  },
  "2.9c": {
    "description": "Promote collaboration by clarifying responsibilities among individual, family, and team members.",
    "level": "Entry-Level"
  },
  "2.9d": {
    "description": "Recognize when additional expertise and knowledge is needed to manage the patient.",
    "level": "Entry-Level"
  },
  "2.9e": {
    "description": "Provide coordination of care of individuals and families in collaboration with care team.",
    "level": "Advanced"
  },
  "2.9f": {
    "description": "Evaluate communication pathways among providers and others across settings, systems, and communities.",
    "level": "Advanced"
  },
  "2.9g": {
    "description": "Develop strategies to optimize care coordination and transitions of care.",
    "level": "Advanced"
  },
  "2.9h": {
    "description": "Guide the coordination of care across health systems.",
    "level": "Advanced"
  },
  "2.9i": {
    "description": "Analyze system-level and public policy influence on care coordination.",
    "level": "Advanced"
  },
  "2.9j": {
    "description": "Participate in system-level change to improve care coordination across settings.",
    "level": "Advanced"
  },
  "3.1a": {
    "description": "Define a target population including its functional and problem-solving capabilities (anywhere in the continuum of care).",
    "level": "Entry-Level"
  },
  "3.1b": {
    "description": "Assess population health data.",
    "level": "Entry-Level"
  },
  "3.1c": {
    "description": "Assess the priorities of the community and/or the affected clinical population.",
    "level": "Entry-Level"
  },
  "3.1d": {
    "description": "Compare and contrast local, regional, national, and global benchmarks to identify health patterns across populations.",
    "level": "Entry-Level"
  },
  "3.1e": {
    "description": "Apply an understanding of the public health system and its interfaces with clinical health care in addressing population health needs.",
    "level": "Entry-Level"
  },
  "3.1f": {
    "description": "Develop an action plan to meet an identified need(s), including evaluation methods.",
    "level": "Entry-Level"
  },
  "3.1g": {
    "description": "Participate in the implementation of sociocultural and linguistically responsive interventions.",
    "level": "Entry-Level"
  },
  "3.1h": {
    "description": "Describe general principles and practices for the clinical management of populations across the age continuum.",
    "level": "Entry-Level"
  },
  "3.1i": {
    "description": "Identify ethical principles to protect the health and safety of diverse populations.",
    "level": "Entry-Level"
  },
  "3.1j": {
    "description": "Assess the efficacy of a system’s capability to serve a target sub-population’s healthcare needs.",
    "level": "Advanced"
  },
  "3.1k": {
    "description": "Analyze primary and secondary population health data for multiple populations against relevant benchmarks.",
    "level": "Advanced"
  },
  "3.1l": {
    "description": "Use established or evolving methods to determine population-focused priorities for care.",
    "level": "Advanced"
  },
  "3.1m": {
    "description": "Develop a collaborative approach with relevant stakeholders to address population healthcare needs, including evaluation methods.",
    "level": "Advanced"
  },
  "3.1n": {
    "description": "Collaborate with appropriate stakeholders to implement a sociocultural and linguistically responsive intervention plan.",
    "level": "Advanced"
  },
  "3.2a": {
    "description": "Engage with other health professionals to address population health issues.",
    "level": "Entry-Level"
  },
  "3.2b": {
    "description": "Demonstrate effective collaboration and mutual accountability with relevant stakeholders.",
    "level": "Entry-Level"
  },
  "3.2c": {
    "description": "Use culturally and linguistically responsive communication strategies.",
    "level": "Entry-Level"
  },
  "3.2d": {
    "description": "Ascertain collaborative opportunities for individuals and organizations to improve population health.",
    "level": "Advanced"
  },
  "3.2e": {
    "description": "Challenge biases and barriers that impact population health outcomes.",
    "level": "Advanced"
  },
  "3.2f": {
    "description": "Evaluate the effectiveness of partnerships for achieving health equity.",
    "level": "Advanced"
  },
  "3.2g": {
    "description": "Lead partnerships to improve population health outcomes.",
    "level": "Advanced"
  },
  "3.2h": {
    "description": "Assess preparation and readiness of partners to organize during natural and manmade disasters.",
    "level": "Advanced"
  },
  "3.3a": {
    "description": "Describe access and equity implications of proposed intervention(s).",
    "level": "Entry-Level"
  },
  "3.3b": {
    "description": "Prioritize patient-focused and/or community action plans that are safe, effective, and efficient in the context of available resources.",
    "level": "Entry-Level"
  },
  "3.3c": {
    "description": "Analyze cost-benefits of selected populationbased interventions.",
    "level": "Advanced"
  },
  "3.3d": {
    "description": "Collaborate with partners to secure and leverage resources necessary for effective, sustainable interventions.",
    "level": "Advanced"
  },
  "3.3e": {
    "description": "Advocate for interventions that maximize costeffective, accessible, and equitable resources for populations.",
    "level": "Advanced"
  },
  "3.3f": {
    "description": "Incorporate ethical principles in resource allocation in achieving equitable health.",
    "level": "Advanced"
  },
  "3.4a": {
    "description": "Describe policy development processes.",
    "level": "Entry-Level"
  },
  "3.4b": {
    "description": "Describe the impact of policies on population outcomes, including social justice and health equity.",
    "level": "Entry-Level"
  },
  "3.4c": {
    "description": "Identify best evidence to support policy development.",
    "level": "Entry-Level"
  },
  "3.4d": {
    "description": "Propose modifications to or development of policy based on population findings.",
    "level": "Entry-Level"
  },
  "3.4e": {
    "description": "Develop an awareness of the interconnectedness of population health across borders.",
    "level": "Entry-Level"
  },
  "3.4f": {
    "description": "Identify opportunities to influence the policy process.",
    "level": "Advanced"
  },
  "3.4g": {
    "description": "Design comprehensive advocacy strategies to support the policy process.",
    "level": "Advanced"
  },
  "3.4h": {
    "description": "Engage in strategies to influence policy change.",
    "level": "Advanced"
  },
  "3.4i": {
    "description": "Contribute to policy development at the system, local, regional, or national levels.",
    "level": "Advanced"
  },
  "3.4j": {
    "description": "Assess the impact of policy changes.",
    "level": "Advanced"
  },
  "3.4k": {
    "description": "Evaluate the ability of policy to address disparities and inequities within segments of the population.",
    "level": "Advanced"
  },
  "3.4l": {
    "description": "Evaluate the risks to population health associated with globalization.",
    "level": "Advanced"
  },
  "3.5a": {
    "description": "Articulate a need for change.",
    "level": "Entry-Level"
  },
  "3.5b": {
    "description": "Describe the intent of the proposed change.",
    "level": "Entry-Level"
  },
  "3.5c": {
    "description": "Define stakeholders, including members of the community and/or clinical populations, and their level of influence.",
    "level": "Entry-Level"
  },
  "3.5d": {
    "description": "Implement messaging strategies appropriate to audience and stakeholders.",
    "level": "Entry-Level"
  },
  "3.5e": {
    "description": "Evaluate the effectiveness of advocacy actions.",
    "level": "Entry-Level"
  },
  "3.5f": {
    "description": "Appraise advocacy priorities for a population.",
    "level": "Advanced"
  },
  "3.5g": {
    "description": "Strategize with an interdisciplinary group and others to develop effective advocacy approaches.",
    "level": "Advanced"
  },
  "3.5h": {
    "description": "Engage in relationship-building activities with stakeholders at any level of influence, including system, local, state, national, and/or global.",
    "level": "Advanced"
  },
  "3.5i": {
    "description": "Demonstrate leadership skills to promote advocacy efforts that include principles of social justice, diversity, equity, and inclusion.",
    "level": "Advanced"
  },
  "3.6a": {
    "description": "Identify changes in conditions that might indicate a disaster or public health emergency.",
    "level": "Entry-Level"
  },
  "3.6b": {
    "description": "Understand the impact of climate change on environmental and population health.",
    "level": "Entry-Level"
  },
  "3.6c": {
    "description": "Describe the health and safety hazards of disasters and public health emergencies.",
    "level": "Entry-Level"
  },
  "3.6d": {
    "description": "Describe the overarching principles and methods regarding personal safety measures, including personal protective equipment (PPE).",
    "level": "Entry-Level"
  },
  "3.6e": {
    "description": "Implement infection control measures and proper use of personal protective equipment.",
    "level": "Entry-Level"
  },
  "3.6f": {
    "description": "Collaboratively initiate rapid response activities to protect population health.",
    "level": "Advanced"
  },
  "3.6g": {
    "description": "Participate in ethical decision making that includes diversity, equity, and inclusion in advanced preparedness to protect populations.",
    "level": "Advanced"
  },
  "3.6h": {
    "description": "Collaborate with interdisciplinary teams to lead preparedness and mitigation efforts to protect population health with attention to the most vulnerable populations.",
    "level": "Advanced"
  },
  "3.6i": {
    "description": "Coordinate the implementation of evidencebased infection control measures and proper use of personal protective equipment.",
    "level": "Advanced"
  },
  "3.6j": {
    "description": "Contribute to system-level planning, decision making, and evaluation for disasters and public health emergencies.",
    "level": "Advanced"
  }
}
