{
  "1.1e": {
    "description": "Translate evidence from nursing science as well as other sciences into practice.",
    "level": "Advanced"
  },
  "1.1f": {
    "description": "Demonstrate the application of nursing science to practice.",
    "level": "Advanced"
  },
  "1.1g": {
    "description": "Integrate an understanding of nursing history in advancing nursing’s influence in health care.",
    "level": "Advanced"
  },
  "1.2f": {
    "description": "Synthesize knowledge from nursing and other disciplines to inform education, practice, and research.",
    "level": "Advanced"
  },
  "1.2g": {
    "description": "Apply a systematic and defendable approach to nursing practice decisions.",
    "level": "Advanced"
  },
  "1.2h": {
    "description": "Employ ethical decision making to assess, intervene, and evaluate nursing care.",
    "level": "Advanced"
  },
  "1.2i": {
    "description": "Demonstrate socially responsible leadership.",
    "level": "Advanced"
  },
  "1.2j": {
    "description": "Translate theories from nursing and other disciplines to practice.",
    "level": "Advanced"
  },
  "1.3d": {
    "description": "Integrate foundational and advanced specialty knowledge into clinical reasoning.",
    "level": "Advanced"
  },
  "1.3e": {
    "description": "Synthesize current and emerging evidence to Influence practice.",
    "level": "Advanced"
  },
  "1.3f": {
    "description": "Analyze decision models from nursing and other knowledge domains to improve clinical judgment.",
    "level": "Advanced"
  },
  "2.1d": {
    "description": "Promote caring relationships to effect positive outcomes.",
    "level": "Advanced"
  },
  "2.1e": {
    "description": "Foster caring relationships.",
    "level": "Advanced"
  },
  "2.2g": {
    "description": "Demonstrate advanced communication skills and techniques using a variety of modalities with diverse audiences.",
    "level": "Advanced"
  },
  "2.2h": {
    "description": "Design evidence-based, person-centered engagement materials.",
    "level": "Advanced"
  },
  "2.2i": {
    "description": "Apply individualized information, such as genetic/genomic, pharmacogenetic, and environmental exposure information in the delivery of personalized health care.",
    "level": "Advanced"
  },
  "2.2j": {
    "description": "Facilitate difficult conversations and disclosure of sensitive information.",
    "level": "Advanced"
  },
  "2.3h": {
    "description": "Demonstrate that one’s practice is informed by a comprehensive assessment appropriate to the functional area of advanced nursing practice.",
    "level": "Advanced"
  },
  "2.4f": {
    "description": "Employ context driven, advanced reasoning to the diagnostic and decision-making process.",
    "level": "Advanced"
  },
  "2.4g": {
    "description": "Integrate advanced scientific knowledge to guide decision making.",
    "level": "Advanced"
  },
  "2.5h": {
    "description": "Lead and collaborate with an interprofessional team to develop a comprehensive plan of care.",
    "level": "Advanced"
  },
  "2.5i": {
    "description": "Prioritize risk mitigation strategies to prevent or reduce adverse outcomes.",
    "level": "Advanced"
  },
  "2.5j": {
    "description": "Develop evidence-based interventions to improve outcomes and safety.",
    "level": "Advanced"
  },
  "2.5k": {
    "description": "Incorporate innovations into practice when evidence is not available.",
    "level": "Advanced"
  },
  "2.6e": {
    "description": "Model best care practices to the team.",
    "level": "Advanced"
  },
  "2.6f": {
    "description": "Monitor aggregate metrics to assure accountability for care outcomes.",
    "level": "Advanced"
  },
  "2.6g": {
    "description": "Promote delivery of care that supports practice at the full scope of education.",
    "level": "Advanced"
  },
  "2.6h": {
    "description": "Contribute to the development of policies and processes that promote transparency and accountability.",
    "level": "Advanced"
  },
  "2.6i": {
    "description": "Apply current and emerging evidence to the development of care guidelines/tools.",
    "level": "Advanced"
  },
  "2.6j": {
    "description": "Ensure accountability throughout transitions of care across the health continuum.",
    "level": "Advanced"
  },
  "2.7d": {
    "description": "Analyze data to identify gaps and inequities in care and monitor trends in outcomes.",
    "level": "Advanced"
  },
  "2.7e": {
    "description": "Monitor epidemiological and system-level aggregate data to determine healthcare outcomes and trends.",
    "level": "Advanced"
  },
  "2.7f": {
    "description": "Synthesize outcome data to inform evidencebased practice, guidelines, and policies.",
    "level": "Advanced"
  },
  "2.8f": {
    "description": "Develop strategies that promote self-care management.",
    "level": "Advanced"
  },
  "2.8g": {
    "description": "Incorporate the use of current and emerging technologies to support self-care management.",
    "level": "Advanced"
  },
  "2.8h": {
    "description": "Employ counseling techniques, including motivational interviewing, to advance wellness and self-care management.",
    "level": "Advanced"
  },
  "2.8i": {
    "description": "Evaluate adequacy of resources available to support self-care management.",
    "level": "Advanced"
  },
  "2.8j": {
    "description": "Foster partnerships with community organizations to support self-care management.",
    "level": "Advanced"
  },
  "2.9e": {
    "description": "Provide coordination of care of individuals and families in collaboration with care team.",
    "level": "Advanced"
  },
  "2.9f": {
    "description": "Evaluate communication pathways among providers and others across settings, systems, and communities.",
    "level": "Advanced"
  },
  "2.9g": {
    "description": "Develop strategies to optimize care coordination and transitions of care.",
    "level": "Advanced"
  },
  "2.9h": {
    "description": "Guide the coordination of care across health systems.",
    "level": "Advanced"
  },
  "2.9i": {
    "description": "Analyze system-level and public policy influence on care coordination.",
    "level": "Advanced"
  },
  "2.9j": {
    "description": "Participate in system-level change to improve care coordination across settings.",
    "level": "Advanced"
  },
  "3.1j": {
    "description": "Assess the efficacy of a system’s capability to serve a target sub-population’s healthcare needs.",
    "level": "Advanced"
  },
  "3.1k": {
    "description": "Analyze primary and secondary population health data for multiple populations against relevant benchmarks.",
    "level": "Advanced"
  },
  "3.1l": {
    "description": "Use established or evolving methods to determine population-focused priorities for care.",
    "level": "Advanced"
  },
  "3.1m": {
    "description": "Develop a collaborative approach with relevant stakeholders to address population healthcare needs, including evaluation methods.",
    "level": "Advanced"
  },
  "3.1n": {
    "description": "Collaborate with appropriate stakeholders to implement a sociocultural and linguistically responsive intervention plan.",
    "level": "Advanced"
  },
  "3.2d": {
    "description": "Ascertain collaborative opportunities for individuals and organizations to improve population health.",
    "level": "Advanced"
  },
  "3.2e": {
    "description": "Challenge biases and barriers that impact population health outcomes.",
    "level": "Advanced"
  },
  "3.2f": {
    "description": "Evaluate the effectiveness of partnerships for achieving health equity.",
    "level": "Advanced"
  },
  "3.2g": {
    "description": "Lead partnerships to improve population health outcomes.",
    "level": "Advanced"
  },
  "3.2h": {
    "description": "Assess preparation and readiness of partners to organize during natural and manmade disasters.",
    "level": "Advanced"
  },
  "3.3c": {
    "description": "Analyze cost-benefits of selected populationbased interventions.",
    "level": "Advanced"
  },
  "3.3d": {
    "description": "Collaborate with partners to secure and leverage resources necessary for effective, sustainable interventions.",
    "level": "Advanced"
  },
  "3.3e": {
    "description": "Advocate for interventions that maximize costeffective, accessible, and equitable resources for populations.",
    "level": "Advanced"
  },
  "3.3f": {
    "description": "Incorporate ethical principles in resource allocation in achieving equitable health.",
    "level": "Advanced"
  },
  "3.4f": {
    "description": "Identify opportunities to influence the policy process.",
    "level": "Advanced"
  },
  "3.4g": {
    "description": "Design comprehensive advocacy strategies to support the policy process.",
    "level": "Advanced"
  },
  "3.4h": {
    "description": "Engage in strategies to influence policy change.",
    "level": "Advanced"
  },
  "3.4i": {
    "description": "Contribute to policy development at the system, local, regional, or national levels.",
    "level": "Advanced"
  },
  "3.4j": {
    "description": "Assess the impact of policy changes.",
    "level": "Advanced"
  },
  "3.4k": {
    "description": "Evaluate the ability of policy to address disparities and inequities within segments of the population.",
    "level": "Advanced"
  },
  "3.4l": {
    "description": "Evaluate the risks to population health associated with globalization.",
    "level": "Advanced"
  },
  "3.5f": {
    "description": "Appraise advocacy priorities for a population.",
    "level": "Advanced"
  },
  "3.5g": {
    "description": "Strategize with an interdisciplinary group and others to develop effective advocacy approaches.",
    "level": "Advanced"
  },
  "3.5h": {
    "description": "Engage in relationship-building activities with stakeholders at any level of influence, including system, local, state, national, and/or global.",
    "level": "Advanced"
  },
  "3.5i": {
    "description": "Demonstrate leadership skills to promote advocacy efforts that include principles of social justice, diversity, equity, and inclusion.",
    "level": "Advanced"
  },
  "3.6f": {
    "description": "Collaboratively initiate rapid response activities to protect population health.",
    "level": "Advanced"
  },
  "3.6g": {
    "description": "Participate in ethical decision making that includes diversity, equity, and inclusion in advanced preparedness to protect populations.",
    "level": "Advanced"
  },
  "3.6h": {
    "description": "Collaborate with interdisciplinary teams to lead preparedness and mitigation efforts to protect population health with attention to the most vulnerable populations.",
    "level": "Advanced"
  },
  "3.6i": {
    "description": "Coordinate the implementation of evidencebased infection control measures and proper use of personal protective equipment.",
    "level": "Advanced"
  },
  "3.6j": {
    "description": "Contribute to system-level planning, decision making, and evaluation for disasters and public health emergencies.",
    "level": "Advanced"
  },
  "4.1h": {
    "description": "Apply and critically evaluate advanced knowledge in a defined area of nursing practice.",
    "level": "Advanced"
  },
  "4.1i": {
    "description": "Engage in scholarship to advance health.",
    "level": "Advanced"
  },
  "4.1j": {
    "description": "Discern appropriate applications of quality improvement, research, and evaluation methodologies.",
    "level": "Advanced"
  },
  "4.1k": {
    "description": "Collaborate to advance one’s scholarship.",
    "level": "Advanced"
  },
  "4.1l": {
    "description": "Disseminate one’s scholarship to diverse audiences using a variety of approaches or modalities.",
    "level": "Advanced"
  },
  "4.1m": {
    "description": "Advocate within the interprofessional team and with other stakeholders for the contributions of nursing scholarship.",
    "level": "Advanced"
  },
  "4.2f": {
    "description": "Use diverse sources of evidence to inform practice.",
    "level": "Advanced"
  },
  "4.2g": {
    "description": "Lead the translation of evidence into practice.",
    "level": "Advanced"
  },
  "4.2h": {
    "description": "Address opportunities for innovation and changes in practice.",
    "level": "Advanced"
  },
  "4.2i": {
    "description": "Collaborate in the development of new/revised policy or regulation in the light of new evidence.",
    "level": "Advanced"
  },
  "4.2j": {
    "description": "Articulate inconsistencies between practice policies and best evidence.",
    "level": "Advanced"
  },
  "4.2k": {
    "description": "Evaluate outcomes and impact of new practices based on the evidence.",
    "level": "Advanced"
  },
  "4.3e": {
    "description": "Identify and mitigate potential risks and areas of ethical concern in the conduct of scholarly activities.",
    "level": "Advanced"
  },
  "4.3f": {
    "description": "Apply IRB guidelines throughout the scholarship process.",
    "level": "Advanced"
  },
  "4.3g": {
    "description": "Ensure the protection of participants in the conduct of scholarship.",
    "level": "Advanced"
  },
  "4.3h": {
    "description": "Implement processes that support ethical conduct in practice and scholarship.",
    "level": "Advanced"
  },
  "4.3i": {
    "description": "Apply ethical principles to the dissemination of nursing scholarship.",
    "level": "Advanced"
  },
  "5.1i": {
    "description": "Establish and incorporate data driven benchmarks to monitor system performance.",
    "level": "Advanced"
  },
  "5.1j": {
    "description": "Use national safety resources to lead teambased change initiatives.",
    "level": "Advanced"
  },
  "5.1k": {
    "description": "Integrate outcome metrics to inform change and policy recommendations.",
    "level": "Advanced"
  },
  "5.1l": {
    "description": "Collaborate in analyzing organizational process improvement initiatives.",
    "level": "Advanced"
  },
  "5.1m": {
    "description": "Lead the development of a business plan for quality improvement initiatives.",
    "level": "Advanced"
  },
  "5.1n": {
    "description": "Advocate for change related to financial policies that impact the relationship between economics and quality care delivery.",
    "level": "Advanced"
  },
  "5.1o": {
    "description": "Advance quality improvement practices through dissemination of outcomes.",
    "level": "Advanced"
  },
  "5.2g": {
    "description": "Evaluate the alignment of system data and comparative patient safety benchmarks.",
    "level": "Advanced"
  },
  "5.2h": {
    "description": "Lead analysis of actual errors, near misses, and potential situations that would impact safety.",
    "level": "Advanced"
  },
  "5.2i": {
    "description": "Design evidence-based interventions to mitigate risk.",
    "level": "Advanced"
  },
  "5.2j": {
    "description": "Evaluate emergency preparedness system-level plans to protect safety.",
    "level": "Advanced"
  },
  "5.3e": {
    "description": "Advocate for structures, policies, and processes that promote a culture of safety and prevent workplace risks and injury.",
    "level": "Advanced"
  },
  "5.3f": {
    "description": "Foster a just culture reflecting civility and respect.",
    "level": "Advanced"
  },
  "5.3g": {
    "description": "Create a safe and transparent culture for reporting incidents.",
    "level": "Advanced"
  },
  "5.3h": {
    "description": "Role model and lead well-being and resiliency for self and team.",
    "level": "Advanced"
  },
  "6.1g": {
    "description": "Evaluate effectiveness of interprofessional communication tools and techniques to support and improve the efficacy of team-based interactions.",
    "level": "Advanced"
  },
  "6.1h": {
    "description": "Facilitate improvements in interprofessional communications of individual information (e.g. EHR).",
    "level": "Advanced"
  },
  "6.1i": {
    "description": "Role model respect for diversity, equity, and inclusion in team-based communications.",
    "level": "Advanced"
  },
  "6.1j": {
    "description": "Communicate nursing’s unique disciplinary knowledge to strengthen interprofessional partnerships.",
    "level": "Advanced"
  },
  "6.1k": {
    "description": "Provide expert consultation for other members of the healthcare team in one’s area of practice.",
    "level": "Advanced"
  },
  "6.1l": {
    "description": "Demonstrate capacity to resolve interprofessional conflict.",
    "level": "Advanced"
  },
  "6.2g": {
    "description": "Integrate evidence-based strategies and processes to improve team effectiveness and outcomes.",
    "level": "Advanced"
  },
  "6.2h": {
    "description": "Evaluate the impact of team dynamics and performance on desired outcomes.",
    "level": "Advanced"
  },
  "6.2i": {
    "description": "Reflect on how one’s role and expertise influences team performance.",
    "level": "Advanced"
  },
  "6.2j": {
    "description": "Foster positive team dynamics to strengthen desired outcomes.",
    "level": "Advanced"
  },
  "6.3d": {
    "description": "Direct interprofessional activities and initiatives.",
    "level": "Advanced"
  },
  "6.4e": {
    "description": "Practice self-assessment to mitigate conscious and implicit biases toward other team members.",
    "level": "Advanced"
  },
  "6.4f": {
    "description": "Foster an environment that supports the constructive sharing of multiple perspectives and enhances interprofessional learning.",
    "level": "Advanced"
  },
  "6.4g": {
    "description": "Integrate diversity, equity, and inclusion into team practices.",
    "level": "Advanced"
  },
  "6.4h": {
    "description": "Manage disagreements, conflicts, and challenging conversations among team members.",
    "level": "Advanced"
  },
  "6.4i": {
    "description": "Promote an environment that advances interprofessional learning.",
    "level": "Advanced"
  },
  "7.1e": {
    "description": "Participate in organizational strategic planning.",
    "level": "Advanced"
  },
  "7.1f": {
    "description": "Participate in system-wide initiatives that improve care delivery and/or outcomes.",
    "level": "Advanced"
  },
  "7.1g": {
    "description": "Analyze system-wide processes to optimize outcomes.",
    "level": "Advanced"
  },
  "7.1h": {
    "description": "Design policies to impact health equity and structural racism within systems, communities, and populations.",
    "level": "Advanced"
  },
  "7.2g": {
    "description": "Analyze relevant internal and external factors that drive healthcare costs and reimbursement.",
    "level": "Advanced"
  },
  "7.2h": {
    "description": "Design practices that enhance value, access, quality, and cost-effectiveness.",
    "level": "Advanced"
  },
  "7.2i": {
    "description": "Advocate for healthcare economic policies and regulations to enhance value, quality, and costeffectiveness.",
    "level": "Advanced"
  },
  "7.2j": {
    "description": "Formulate, document, and disseminate the return on investment for improvement initiatives collaboratively with an interdisciplinary team.",
    "level": "Advanced"
  },
  "7.2k": {
    "description": "Recommend system-wide strategies that improve cost- effectiveness considering structure, leadership, and workforce needs.",
    "level": "Advanced"
  },
  "7.2l": {
    "description": "Evaluate health policies based on an ethical framework considering cost-effectiveness, health equity, and care outcomes.",
    "level": "Advanced"
  },
  "7.3e": {
    "description": "Apply innovative and evidence-based strategies focusing on system preparedness and capabilities.",
    "level": "Advanced"
  },
  "7.3f": {
    "description": "Design system improvement strategies based on performance data and metrics.",
    "level": "Advanced"
  },
  "7.3g": {
    "description": "Manage change to sustain system effectiveness.",
    "level": "Advanced"
  },
  "7.3h": {
    "description": "Design system improvement strategies that address internal and external system processes and structures that perpetuate structural racism and other forms of discrimination in healthcare systems.",
    "level": "Advanced"
  },
  "8.1g": {
    "description": "Identify best evidence and practices for the application of information and communication technologies to support care.",
    "level": "Advanced"
  },
  "8.1h": {
    "description": "Evaluate the unintended consequences of information and communication technologies on care processes, communications, and information flow across care settings.",
    "level": "Advanced"
  },
  "8.1i": {
    "description": "Propose a plan to influence the selection and implementation of new information and communication technologies.",
    "level": "Advanced"
  },
  "8.1j": {
    "description": "Explore the fiscal impact of information and communication technologies on health care.",
    "level": "Advanced"
  },
  "8.1k": {
    "description": "Identify the impact of information and communication technologies on workflow processes and healthcare outcomes.",
    "level": "Advanced"
  },
  "8.2f": {
    "description": "Generate information and knowledge from health information technology databases.",
    "level": "Advanced"
  },
  "8.2g": {
    "description": "Evaluate the use of communication technology to improve consumer health information literacy.",
    "level": "Advanced"
  },
  "8.2h": {
    "description": "Use standardized data to evaluate decisionmaking and outcomes across all systems levels.",
    "level": "Advanced"
  },
  "8.2i": {
    "description": "Clarify how the collection of standardized data advances the practice, understanding, and value of nursing and supports care.",
    "level": "Advanced"
  },
  "8.2j": {
    "description": "Interpret primary and secondary data and other information to support care.",
    "level": "Advanced"
  },
  "8.3g": {
    "description": "Evaluate the use of information and communication technology to address needs, gaps, and inefficiencies in care.",
    "level": "Advanced"
  },
  "8.3h": {
    "description": "Formulate a plan to influence decisionmaking processes for selecting, implementing, and evaluating support tools.",
    "level": "Advanced"
  },
  "8.3i": {
    "description": "Appraise the role of information and communication technologies in engaging the patient and supporting the nurse-patient relationship.",
    "level": "Advanced"
  },
  "8.3j": {
    "description": "Evaluate the potential uses and impact",
    "level": "Advanced"
  },
  "8.3k": {
    "description": "Pose strategies to reduce inequities in digital access to data and information.",
    "level": "Advanced"
  },
  "8.4e": {
    "description": "Assess best practices for the use of advanced information and communication technologies to support patient and team communications.",
    "level": "Advanced"
  },
  "8.4f": {
    "description": "Employ electronic health, mobile health, and telehealth systems to enable quality, ethical, and efficient patient care.",
    "level": "Advanced"
  },
  "8.4g": {
    "description": "Evaluate the impact of health information exchange, interoperability, and integration to support patient-centered care.",
    "level": "Advanced"
  },
  "8.5g": {
    "description": "Apply risk mitigation and security strategies to reduce misuse of information and communication technology.",
    "level": "Advanced"
  },
  "8.5h": {
    "description": "Assess potential ethical and legal issues associated with the use of information and communication technology.",
    "level": "Advanced"
  },
  "8.5i": {
    "description": "Recommend strategies to protect health information when using communication and information technology.",
    "level": "Advanced"
  },
  "8.5j": {
    "description": "Promote patient engagement with their personal health data.",
    "level": "Advanced"
  },
  "8.5k": {
    "description": "Advocate for policies and regulations that support the appropriate use of technologies impacting health care.",
    "level": "Advanced"
  },
  "8.5l": {
    "description": "Analyze the impact of federal and state policies and regulation on health data and technology in care settings.",
    "level": "Advanced"
  },
  "9.1h": {
    "description": "Analyze current policies and practices in the context of an ethical framework.",
    "level": "Advanced"
  },
  "9.1i": {
    "description": "Model ethical behaviors in practice and leadership roles.",
    "level": "Advanced"
  },
  "9.1j": {
    "description": "Suggest solutions when unethical behaviors are observed.",
    "level": "Advanced"
  },
  "9.1k": {
    "description": "Assume accountability for working to resolve ethical dilemmas.",
    "level": "Advanced"
  },
  "9.2h": {
    "description": "Foster opportunities for intentional presence in practice.",
    "level": "Advanced"
  },
  "9.2i": {
    "description": "Identify innovative and evidence-based practices that promote person-centered care.",
    "level": "Advanced"
  },
  "9.2j": {
    "description": "Advocate for practices that advance diversity, equity, and inclusion.",
    "level": "Advanced"
  },
  "9.2k": {
    "description": "Model professional expectations for therapeutic relationships.",
    "level": "Advanced"
  },
  "9.2l": {
    "description": "Facilitate communication that promotes a participatory approach.",
    "level": "Advanced"
  },
  "9.3i": {
    "description": "Advocate for nursing’s professional responsibility for ensuring optimal care outcomes",
    "level": "Advanced"
  },
  "9.3j": {
    "description": "Demonstrate leadership skills when participating in professional activities and/or organizations.",
    "level": "Advanced"
  },
  "9.3k": {
    "description": "Address actual or potential hazards and/or errors.",
    "level": "Advanced"
  },
  "9.3l": {
    "description": "Foster a practice environment that promotes accountability for care outcomes.",
    "level": "Advanced"
  },
  "9.3m": {
    "description": "Advocate for policies/practices that promote social justice and health equity.",
    "level": "Advanced"
  },
  "9.3n": {
    "description": "Foster strategies that promote a culture of civility across a variety of settings.",
    "level": "Advanced"
  },
  "9.3o": {
    "description": "Lead in the development of opportunities for professional and interprofessional activities.",
    "level": "Advanced"
  },
  "9.4d": {
    "description": "Advocate for polices that enable nurses to practice to the full extent of their education.",
    "level": "Advanced"
  },
  "9.4e": {
    "description": "Assess the interaction between regulatory agency requirements and quality, fiscal, and value-based indicators.",
    "level": "Advanced"
  },
  "9.4f": {
    "description": "Evaluate the effect of legal and regulatory policies on nursing practice and healthcare outcomes.",
    "level": "Advanced"
  },
  "9.4g": {
    "description": "Analyze efforts to change legal and regulatory policies that improve nursing practice and health outcomes.",
    "level": "Advanced"
  },
  "9.4h": {
    "description": "Participate in the implementation of policies and regulations to improve the professional practice environment and healthcare outcomes.",
    "level": "Advanced"
  },
  "9.5f": {
    "description": "Articulate nursing’s unique professional identity to other interprofessional team members and the public.",
    "level": "Advanced"
  },
  "9.5g": {
    "description": "Evaluate practice environment to ensure that nursing core values are demonstrated.",
    "level": "Advanced"
  },
  "9.5h": {
    "description": "Identify opportunities to lead with moral courage to influence team decision-making.",
    "level": "Advanced"
  },
  "9.5i": {
    "description": "Engage in professional organizations that reflect nursing’s values and identity.",
    "level": "Advanced"
  },
  "9.6d": {
    "description": "Model respect for diversity, equity, and inclusion for all team members.",
    "level": "Advanced"
  },
  "9.6e": {
    "description": "Critique one’s personal and professional practices in the context of nursing’s core values.",
    "level": "Advanced"
  },
  "9.6f": {
    "description": "Analyze the impact of structural and cultural influences on nursing’s professional identity",
    "level": "Advanced"
  },
  "9.6g": {
    "description": "Ensure that care provided by self and others is reflective of nursing’s core values.",
    "level": "Advanced"
  },
  "9.6h": {
    "description": "Structure the practice environment to facilitate care that is culturally and linguistically appropriate.",
    "level": "Advanced"
  },
  "9.6i": {
    "description": "Ensure self and others are accountable in upholding moral, legal, and humanistic principles related to health.",
    "level": "Advanced"
  },
  "10.1c": {
    "description": "Contribute to an environment that promotes self-care, personal health, and well-being.",
    "level": "Advanced"
  },
  "10.1d": {
    "description": "Evaluate the workplace environment to determine level of health and well-being.",
    "level": "Advanced"
  },
  "10.2f": {
    "description": "Identify role models and mentors to support professional growth.",
    "level": "Advanced"
  },
  "10.2g": {
    "description": "Demonstrate cognitive flexibility in managing change within complex environments.",
    "level": "Advanced"
  },
  "10.2h": {
    "description": "Mentor others in the development of their professional growth and accountability",
    "level": "Advanced"
  },
  "10.2i": {
    "description": "Foster activities that support a culture of lifelong learning.",
    "level": "Advanced"
  },
  "10.2j": {
    "description": "Expand leadership skills through professional service.",
    "level": ""
  },
  "10.3j": {
    "description": "Provide leadership to advance the nursing profession.",
    "level": "Advanced"
  },
  "10.3k": {
    "description": "k Influence intentional change guided by leadership principles and theories.",
    "level": "Advanced"
  },
  "10.3l": {
    "description": "Evaluate the outcomes of intentional change.",
    "level": "Advanced"
  },
  "10.3m": {
    "description": "Evaluate strategies/methods for peer review.",
    "level": "Advanced"
  },
  "10.3n": {
    "description": "Participate in the evaluation of other members of the care team.",
    "level": "Advanced"
  },
  "10.3o": {
    "description": "Demonstrate leadership skills in times of uncertainty and crisis.",
    "level": "Advanced"
  },
  "10.3p": {
    "description": "Advocate for the promotion of social justice and eradication of structural racism and systematic inequity in nursing and society.",
    "level": "Advanced"
  },
  "10.3q": {
    "description": "Advocate for the nursing profession in a manner that is consistent, positive, relevant, accurate, and distinctive.",
    "level": "Advanced"
  }
}
