{
  "NURS 500": [
    "Not aligned with specific course objective(s)",
    "Identify key theories and models that inform strategies for promoting optimal health outcomes for diverse systems (i.e. individuals, families, communities, and populations).",
    "Use epidemiologic data to evaluate socio-ecological, biological, behavioral and global determinants of health for evidence-based clinical prevention and health promotion interventions for individuals, families, communities, populations and systems.",
    "Use leadership and advocacy strategies to promote equitable, ethical and effective health policy in community, population and global health through inter- and intra-professional approaches to service delivery.",
    "Articulate design principles in health care delivery systems at micro, meso and macro levels that promote consistently safe, high quality and equitable care for diverse systems (i.e. individuals, families, communities and populations).",
    "Evaluate models and leadership principles that facilitate inter-professional quality improvement or safety initiatives.",
    "Apply multiple methods to analyze health and disease across diverse systems (i.e. individuals, families, communities and populations) and develop strategies for quality improvement and health promotion."
  ],
  "NURS 502": [
    "Not aligned with specific course objective(s)",
    "Analyze the physiological mechanisms, control systems, and defense processes that maintain homeostasis.",
    "Apply molecular and cellular concepts to the etiology and pathogenesis of disease processes and syndromes.",
    "Predict from physiological disruptions, the possible clinical features and complications of specific diseases.",
    "Distinguish between adaptive and maladaptive physiological responses to disease processes.",
    "Synthesize the effects of disease that lead to the involvement of multiple systems in either acute or chronic diseases."
  ],
  "NURS 503": [
    "Not aligned with specific course objective(s)",
    "Utilize a communication style characterized by sensitive awareness of the diverse needs of individuals, and skill in obtaining and integrating the health history including pertinent contextual information such as age, gender, socioeconomic status, culture, ethnicity, social support, lifestyle, and critical environments.",
    "Appropriately utilize and interpret assessment strategies including clinical interviewing, physical examination techniques, diagnostic procedures, and common laboratory testing in the health assessment of individuals across the lifespan. Interpretation includes recognizing variations of, and deviations from, normal. Utilize appropriate information technology to gather, analyze, and record data.",
    "Demonstrate sound critical thinking, diagnostic reasoning, and clinical decision-making skills in obtaining, interpreting, and integrating health assessments, and recognizing actual and potential problems.",
    "Synthesize case-based knowledge in a comprehensive, developmentally appropriate approach to both focused and health maintenance assessments.",
    "Demonstrate competence in both the written documentation and oral presentation of health assessments. Utilize information technology appropriately in communication and documentation."
  ],
  "NURS 523": [
    "Not aligned with specific course objective(s)",
    "Describe the regulatory and certification guidelines for APRN practice.",
    "Articulate their identity generally as an APRN and identify their area of specialization and population foci specifically.",
    "Demonstrate comprehensive knowledge of health policies that impact advanced nursing practice.",
    "Identify ethical and legal issues encountered by APRNs.",
    "Explore the history and educational pathways for the different APRNs.",
    "Associate the MSN and DNP competencies with role assimilation."
  ],
  "NURS 546": [
    "Not aligned with specific course objective(s)",
    "Examine the importance of environment, culture, occupation, family systems, and individual factors on pregnancy.",
    "Demonstrate proficiency in the care of people during essentially uncomplicated pregnancies, in accordance with current evidence-based practice.",
    "Apply knowledge of screening, recognition, management, referral, and follow up for common complications of pregnancy, in accordance with current evidence-based practice and appropriate use of technology.",
    "Utilize principles of teaching/learning in preparing individual people/families for childbearing.",
    "Develop skills in the interdependent professional model of practice which includes consultation, collaboration, and referral with other health team members for the provision of prenatal care.",
    "Integrate evidence-based strategies to reduce disparities in maternal and infant health."
  ],
   "NURS 561": [
    "Not aligned with specific course objective(s)",
    "Describe physiologic and development processes across the lifespan including menarche, pregnancy, birth and menopause and the role of patient education and empowerment in health promotion.",
    "Describe socio-political, cultural, community, family and psychosocial factors that contribute to health and decision making to assist the nurse-midwifery student in becoming a change agent within the health care system.",
    "Develop skills to provide care that is trauma informed, congruent with midwifery philosophy, person centered, and is inclusive of diverse histories, backgrounds and identities with an emphasis on the therapeutic value of human presence.",
    "Explore the intersections of racism, discrimination based on sexual and gender identity, sexism, ability and immigration status, and class on midwifery care.",
    "Apply knowledge of ethical theories and principles in the consideration of ethical dilemmas and their legal implications in clinical practice."
  ],
  "NURS 566": [
    "Not aligned with specific course objective(s)",
    "Analyze and apply essential primary care nursing concepts with a community health nursing framework.",
    "Apply the components of the nurse-midwifery/nurse practitioner management process, i.e., assess, diagnose, manage, and evaluate the health needs of clients who are adolescent through older adult using knowledge, concepts, and models from nurse-midwifery/nurse practitioner practice.",
    "Analyze the role of the nurse practitioner/nurse-midwife in health promotion and management of common, acute, primary care needs including well woman/gynecological care and men’s health.",
    "Utilize relevant evidence based, biopsychosocial, feminist, genetic, cultural theories, and information technology in providing gender and age specific care for individuals from a variety of cultural, socioeconomic status, and racial/ethnic backgrounds with common acute problems and health promotion needs.",
    "Demonstrate the ability to assess, diagnose, manage and evaluate clients with common acute health problems and health promotion/maintenance needs.",
    "Develop collaborative relationships with other health care providers.",
    "Identify and refer clients and/or situations requiring consultation and collaboration."
  ],
  "PHARMACY 620": [
    "Not aligned with specific course objective(s)",
    "Explain the mechanisms of action for major classes of drugs.",
    "Describe the clinical implications of pharmacokinetics and pharmacodynamics to major drug classes and selected drugs.",
    "Distinguish developmental and/or age-related differences in individuals that can affect drug therapy across the lifespan.",
    "Apply principles of pharmacology and pharmacotherapeutics to the selection of drug therapy for patients across the life span.",
    "Use current research data and consensus guidelines to make appropriate evidence-based decisions about drug therapy in patient care.",
    "Identify actual and potential adverse drug reactions associated with major drug classes."
  ],
  "HS 700": [
    "Not aligned with specific course objective(s)",
    "Recognize the types of numerical data and apply appropriate descriptive statistics to produce summary measures and graphics.",
    "Utilize a statistical software program for basic data analysis.",
    "Select and apply the appropriate statistical technique to test a hypothesis.",
    "Interpret results of statistical techniques covered in class including the assessment of the role of chance.",
    "Be able to evaluate the performance of a diagnostic test.",
    "Identify key applications of statistical techniques to clinical research and practice."
  ],
  "NURS 676": [
    "Not aligned with specific course objective(s)",
    "Integrate knowledge of the physiology of reproduction and current research/evidence into providing midwifery care during the intrapartum, postpartum period and of the neonate.",
    "During the intrapartum period, using data gathered from EHR, patient and assessment, assess labor progress and develop a plan in partnership with patients, demonstrating skillful communication, guidance and counseling and advocating for informed choice and the right to self determination.",
    "Develop practices that address health disparities related to patient and newborn health outcomes and social determinants of health related to the intrapartum, postpartum and newborn care including race, gender, culture and socio-economic status.",
    "Develop skills needed to provide support for physical, psychological, emotional, spiritual and social needs during labor and birth, applying pharmacologic and non-pharmacological strategies to facilitate coping.",
    "Apply advocacy for non-intervention while identifying deviations from normal during labor, birth and postpartum and implement appropriate interventions including immediate intervention, consultation and referral.",
    "Identify physiologic deviations for the newborn and implement appropriate interventions including immediate intervention, consultation and referral."
  ],
  "NURS 677": [
    "Not aligned with specific course objective(s)",
    "Integrate the role of the nurse-midwife into the provision of evidence-based clinical care.",
    "Integrate evidence-based strategies to reduce disparities in maternal and infant health.",
    "Demonstrate mastery of midwifery care content in preparation for the comprehensive exam and AMCB Boards.",
    "Demonstrate the professional role of the midwife by developing competence in building collegial relationships with multiple professional or patient advocacy groups including but not limited to the midwifery community, nurses, physicians, and community-based midwives."
  ],
  "NURS 803": [
    "Not aligned with specific course objectives(s)",
    "Demonstrate the ability to identify ethical breaches in research and scholarship, and an awareness of the challenges nurse scientists and clinical scholars face in upholding the principles of RCRS.",
    "Demonstrate mastery of appropriate, proactive, and pragmatic strategies for dealing with challenges to the conduct of research and scholarship in academia, the administrative, clinical and community settings.",
    "Demonstrate an awareness of the role of a nurse scientist in academic, clinical, and community settings, and the impact of nursing research and scholarship on society locally and globally."
  ],
   "NURS 815": [
    "Not aligned with specific course objectives(s)",
    "Compare and contrast theoretical formulations and models of quality improvement and patient safety.",  
    "Critique and synthesize quality improvement and patient safety research for application in healthcare analysis, create, and evaluate quality improvement and patient safety programs for healthcare organizations.", 
    "Analyze state and national trends for impact on patient safety, quality, and equity.",
    "Evaluate the impact and consequences of technologies and informatics approaches on people, processes, and policies within the culture of quality, safety, and high reliability.",
    "Apply a variety of methodological approaches and tools to improve patient safety and quality of care."
  ],
  "NURS 832": [
    "Not aligned with specific course objectives(s)",
    "Apply leadership strategies to diverse work teams in the design and evaluation of clinical programs from the perspective of nursing, organizational, political, and economic sciences.",
    "Apply theories from the management and team sciences relevant to the role of clinical leader of inter-and intra-professional care delivery teams.",
    "Assess and identify factors in the work environment that influence provider performance and quality of care.",
    "Analyze the role of the clinical leader in developing innovation and managing sustainable change to improve patient care and clinical performance.",
    "Evaluate how the current health care financial environment impacts institutional resource allocation and decision making in the delivery of cost-effective care.",
    "Critique reimbursement models and their impact on allocation and evaluation of resources to achieve desired clinical outcomes of care.",
    "Analyze population needs and stakeholders in the market context from an institutional perspective.",
    "Synthesize research from management, leadership, and ethics into decision making strategies as leaders in clinical systems."
  ],
  "NURS 900": [
    "Not aligned with specific course objectives(s)",
    "Evaluate the philosophical assumptions underlying theory that guides current practice.",
    "Apply systematic and integrative reviews to clinical practice and policy.",
    "Evaluate the strengths and limitations of methods for systematic and integrative reviews guiding clinical practice.",
    "Identify the theoretical framework guiding the clinical practice problem or potential solutions.",
    "Conduct and document the process for an integrative review of the scientific literature around a clinical practice problem/solution.",
    "Apply ethical conduct in the synthesis of evidence to advance quality in clinical practice."
  ],
  "NURS 910": [
    "Not aligned with specific course objectives(s)",
    "Critique models of translation, implementation science, and comparative effectiveness research.", 
    "Synthesize research on translation and implementation science and comparative effectiveness research for application to a specific patient population or system of healthcare delivery.",  
    "Differentiate among types of translation science, implementation science, and comparative effectiveness research.",  
    "Analyze state and national trends that impact comparative effectiveness research, and translation and implementation science.", 
    "Develop a model of EBP, innovation adoption, or translation science to improve healthcare and address health disparities.", 
    "Propose a demonstration project to promote adoption of evidence-based practices and healthcare innovations."
  ],
  "NURS 950": [
    "Not aligned with specific course objectives(s)",
    "Demonstrate competencies of a DNP-prepared nurse using a theoretical foundation as they apply to senior leadership roles and responsibilities.",
    "Reflect on their leadership abilities and identify areas for continued growth and development.",
    "Analyze challenges and issues faced in organizations and propose solutions to address them",
    "Demonstrate their ability to develop the leadership role of a DNP-prepared nurse in the clinical enterprise."
  ],
  "NURS 960": [
    "Not aligned with specific course objectives(s)",
    "Provide high level independent practice as a member of a health care team or practice.", 
    "Collaborate with multi-stakeholders to identify needs in quality, safety and equity in a population or within health care system.", 
    "Collaboratively develop a team-based practice project that translates evidence-based knowledge."  
  ],
   "NURS 965": [
    "Not aligned with specific course objectives(s)",
    "Provide high level independent practice as a member of a health care team or practice",
    "Collaborate with multi-stakeholders to identify needs in quality, safety and equity in a population or within health care system",
    "Collaboratively implement a team-based practice project that translates evidenced based knowledge",
    "Identify project appropriate evaluation criteria and timeframe",
    "Develop a disseminatable project product that demonstrates expertise in an area of practice inquiry"
  ]
}
