{
  "1.1a": {
    "description": "Identify concepts, derived from theories from nursing and other disciplines, which distinguish the practice of nursing."
  },
  "1.1b": {
    "description": "Apply knowledge of nursing science that develops a foundation for nursing practice."
  },
  "1.1c": {
    "description": "Understand the historical foundation of nursing as the relationship developed between the individual and nurse."
  },
  "1.1d": {
    "description": "Articulate nursing’s distinct perspective to practice."
  },
  "1.2a": {
    "description": "Apply or employ knowledge from nursing science as well as the natural, physical, and social sciences to build an understanding of the human experience and nursing practice."
  },
  "1.2b": {
    "description": "Demonstrate intellectual curiosity."
  },
  "1.2c": {
    "description": "Demonstrate social responsibility as a global citizen who fosters the attainment of health equity for all."
  },
  "1.2d": {
    "description": "Examine influence of personal values in decision making for nursing practice."
  },
  "1.2e": {
    "description": "Demonstrate ethical decision making."
  },
  "1.3a": {
    "description": "Demonstrate clinical reasoning."
  },
  "1.3b": {
    "description": "Integrate nursing knowledge (theories, multiple ways of knowing, evidence) and knowledge from other disciplines and inquiry to inform clinical judgment."
  },
  "1.3c": {
    "description": "Incorporate knowledge from nursing and other disciplines to support clinical judgment."
  },
  "2.1a": {
    "description": "Demonstrate qualities of empathy."
  },
  "2.1b": {
    "description": "Demonstrate compassionate care."
  },
  "2.1c": {
    "description": "Establish mutual respect with the individual and family."
  },
  "2.2a": {
    "description": "Demonstrate relationship-centered care."
  },
  "2.2b": {
    "description": "Consider individual beliefs, values, and personalized information in communications."
  },
  "2.2c": {
    "description": "Use a variety of communication modes appropriate for the context."
  },
  "2.2d": {
    "description": "Demonstrate the ability to conduct sensitive or difficult conversations."
  },
  "2.2e": {
    "description": "Use evidence-based patient teaching materials, considering health literacy, vision, hearing, and cultural sensitivity."
  },
  "2.2f": {
    "description": "Demonstrate emotional intelligence in communications."
  },
  "2.3a": {
    "description": "Create an environment during assessment that promotes a dynamic interactive experience."
  },
  "2.3b": {
    "description": "Obtain a complete and accurate history in a systematic manner."
  },
  "2.3c": {
    "description": "Perform a clinically relevant, holistic health assessment."
  },
  "2.3d": {
    "description": "Perform point of care screening/diagnostic testing (e.g. blood glucose, PO2, EKG)."
  },
  "2.3e": {
    "description": "Distinguish between normal and abnormal health findings."
  },
  "2.3f": {
    "description": "Apply nursing knowledge to gain a holistic perspective of the person, family, community, and population."
  },
  "2.3g": {
    "description": "Communicate findings of a comprehensive assessment."
  },
  "2.4a": {
    "description": "Synthesize assessment data in the context of the individual’s current preferences, situation, and experience."
  },
  "2.4b": {
    "description": "Create a list of problems/health concerns."
  },
  "2.4c": {
    "description": "Prioritize problems/health concerns."
  },
  "2.4d": {
    "description": "Understand and apply the results of social screening, psychological testing, laboratory data, imaging studies, and other diagnostic tests in actions and plans of care."
  },
  "2.4e": {
    "description": "Contribute as a team member to the formation and improvement of diagnoses."
  },
  "2.5a": {
    "description": "Engage the individual and the team in plan development."
  },
  "2.5b": {
    "description": "Organize care based on mutual health goals."
  },
  "2.5c": {
    "description": "Prioritize care based on best evidence."
  },
  "2.5d": {
    "description": "Incorporate evidence-based intervention to improve outcomes and safety."
  },
  "2.5e": {
    "description": "Anticipate outcomes of care (expected, unexpected, and potentially adverse)."
  },
  "2.5f": {
    "description": "Demonstrate rationale for plan."
  },
  "2.5g": {
    "description": "Address individuals’ experiences and perspectives in designing plans of care."
  },
  "2.6a": {
    "description": "Implement individualized plan of care using established protocols."
  },
  "2.6b": {
    "description": "Communicate care delivery through multiple modalities."
  },
  "2.6c": {
    "description": "Delegate appropriately to team members."
  },
  "2.6d": {
    "description": "Monitor the implementation of the plan of care."
  },
  "2.7a": {
    "description": "Reassess the individual to evaluate health outcomes/goals"
  },
  "2.7b": {
    "description": "Modify plan of care as needed."
  },
  "2.7c": {
    "description": "Recognize the need for modifications to standard practice."
  },
  "2.8a": {
    "description": "Assist the individual to engage in self-care management."
  },
  "2.8b": {
    "description": "Employ individualized educational strategies based on learning theories, methodologies, and health literacy."
  },
  "2.8c": {
    "description": "Educate individuals and families regarding selfcare for health promotion, illness prevention, and illness management."
  },
  "2.8d": {
    "description": "Respect individuals and families’ selfdetermination in their healthcare decisions."
  },
  "2.8e": {
    "description": "Identify personal, system, and community resources available to support self-care management."
  },
  "2.9a": {
    "description": "Facilitate continuity of care based on assessment of assets and needs."
  },
  "2.9b": {
    "description": "Communicate with relevant stakeholders across health systems."
  },
  "2.9c": {
    "description": "Promote collaboration by clarifying responsibilities among individual, family, and team members."
  },
  "2.9d": {
    "description": "Recognize when additional expertise and knowledge is needed to manage the patient."
  },
  "3.1a": {
    "description": "Define a target population including its functional and problem-solving capabilities (anywhere in the continuum of care)."
  },
  "3.1b": {
    "description": "Assess population health data."
  },
  "3.1c": {
    "description": "Assess the priorities of the community and/or the affected clinical population."
  },
  "3.1d": {
    "description": "Compare and contrast local, regional, national, and global benchmarks to identify health patterns across populations."
  },
  "3.1e": {
    "description": "Apply an understanding of the public health system and its interfaces with clinical health care in addressing population health needs."
  },
  "3.1f": {
    "description": "Develop an action plan to meet an identified need(s), including evaluation methods."
  },
  "3.1g": {
    "description": "Participate in the implementation of sociocultural and linguistically responsive interventions."
  },
  "3.1h": {
    "description": "Describe general principles and practices for the clinical management of populations across the age continuum."
  },
  "3.1i": {
    "description": "Identify ethical principles to protect the health and safety of diverse populations."
  },
  "3.2a": {
    "description": "Engage with other health professionals to address population health issues."
  },
  "3.2b": {
    "description": "Demonstrate effective collaboration and mutual accountability with relevant stakeholders."
  },
  "3.2c": {
    "description": "Use culturally and linguistically responsive communication strategies."
  },
  "3.3a": {
    "description": "Describe access and equity implications of proposed intervention(s)."
  },
  "3.3b": {
    "description": "Prioritize patient-focused and/or community action plans that are safe, effective, and efficient in the context of available resources."
  },
  "3.4a": {
    "description": "Describe policy development processes."
  },
  "3.4b": {
    "description": "Describe the impact of policies on population outcomes, including social justice and health equity."
  },
  "3.4c": {
    "description": "Identify best evidence to support policy development."
  },
  "3.4d": {
    "description": "Propose modifications to or development of policy based on population findings."
  },
  "3.4e": {
    "description": "Develop an awareness of the interconnectedness of population health across borders."
  },
  "3.5a": {
    "description": "Articulate a need for change."
  },
  "3.5b": {
    "description": "Describe the intent of the proposed change."
  },
  "3.5c": {
    "description": "Define stakeholders, including members of the community and/or clinical populations, and their level of influence."
  },
  "3.5d": {
    "description": "Implement messaging strategies appropriate to audience and stakeholders."
  },
  "3.5e": {
    "description": "Evaluate the effectiveness of advocacy actions."
  },
  "3.6a": {
    "description": "Identify changes in conditions that might indicate a disaster or public health emergency."
  },
  "3.6b": {
    "description": "Understand the impact of climate change on environmental and population health."
  },
  "3.6c": {
    "description": "Describe the health and safety hazards of disasters and public health emergencies."
  },
  "3.6d": {
    "description": "Describe the overarching principles and methods regarding personal safety measures, including personal protective equipment (PPE)."
  },
  "3.6e": {
    "description": "Implement infection control measures and proper use of personal protective equipment."
  },
  "4.1a": {
    "description": "Demonstrate an understanding of different approaches to scholarly practice."
  },
  "4.1b": {
    "description": "Demonstrate application of different levels of evidence."
  },
  "4.1c": {
    "description": "Apply theoretical framework(s)/models in practice."
  },
  "4.1d": {
    "description": "Demonstrate an understanding of basic elements of the research process."
  },
  "4.1e": {
    "description": "Participate in scholarly inquiry as a team member."
  },
  "4.1f": {
    "description": "Evaluate research."
  },
  "4.1g": {
    "description": "Communicate scholarly findings"
  },
  "4.2a": {
    "description": "Evaluate clinical practice to generate questions to improve nursing care."
  },
  "4.2b": {
    "description": "Evaluate appropriateness and strength of the evidence."
  },
  "4.2c": {
    "description": "Use best evidence in practice."
  },
  "4.2d": {
    "description": "Participate in the implementation of a practice change to improve nursing care."
  },
  "4.2e": {
    "description": "Participate in the evaluation of outcomes and their implications for practice."
  },
  "4.3a": {
    "description": "Explain the rationale for ethical research guidelines, including Institutional Review Board (IRB) guidelines."
  },
  "4.3b": {
    "description": "Demonstrate ethical behaviors in scholarly projects including quality improvement and EBP initiatives."
  },
  "4.3c": {
    "description": "Advocate for the protection of participants in the conduct of scholarly initiatives."
  },
  "4.3d": {
    "description": "Recognize the impact of equity issues in research."
  },
  "5.1a": {
    "description": "minimize risk of harm to patients and providers through both system effectiveness and"
  },
  "5.1b": {
    "description": "individual performance."
  },
  "5.1c": {
    "description": "Implement standardized, evidence-based processes for care delivery."
  },
  "5.1d": {
    "description": "Interpret benchmark and unit outcome data to inform individual and microsystem practice."
  },
  "5.1e": {
    "description": "Compare quality improvement methods in the delivery of patient care."
  },
  "5.1f": {
    "description": "Identify strategies to improve outcomes of patient care in practice."
  },
  "5.1g": {
    "description": "Participate in the implementation of a practice change."
  },
  "5.1h": {
    "description": "Develop a plan for monitoring quality improvement change."
  },
  "5.2a": {
    "description": "Describe the factors that create a culture of safety"
  },
  "5.2b": {
    "description": "Articulate the nurse’s role within an interprofessional team in promoting safety and preventing errors and near misses."
  },
  "5.2c": {
    "description": "Examine basic safety design principles to reduce risk of harm."
  },
  "5.2d": {
    "description": "Assume accountability for reporting unsafe conditions, near misses, and errors to reduce harm."
  },
  "5.2e": {
    "description": "Describe processes used in understanding causes of error."
  },
  "5.2f": {
    "description": "Use national patient safety resources, initiatives, and regulations at the point of care."
  },
  "5.3a": {
    "description": "Identify actual and potential level of risks to providers within the workplace."
  },
  "5.3b": {
    "description": "Recognize how to prevent workplace violence and injury."
  },
  "5.3c": {
    "description": "Promote policies for prevention of violence and risk mitigation."
  },
  "5.3d": {
    "description": "Recognize one’s role in sustaining a just culture reflecting civility and respect."
  },
  "6.1a": {
    "description": "Communicate the nurse’s roles and responsibilities clearly."
  },
  "6.1b": {
    "description": "Use various communication tools and techniques effectively."
  },
  "6.1c": {
    "description": "Elicit the perspectives of team members to inform person-centered care decision making."
  },
  "6.1d": {
    "description": "Articulate impact of diversity, equity, and inclusion on team-based communications."
  },
  "6.1e": {
    "description": "Communicate individual information in a professional, accurate, and timely manner."
  },
  "6.1f": {
    "description": "Communicate as informed by legal, regulatory, and policy guidelines."
  },
  "6.2a": {
    "description": "Apply principles of team dynamics, including team roles, to facilitate effective team functioning."
  },
  "6.2b": {
    "description": "Delegate work to team members based on their roles and competency."
  },
  "6.2c": {
    "description": "Engage in the work of the team as appropriate to one’s scope of practice and competency."
  },
  "6.2d": {
    "description": "Recognize how one’s uniqueness (as a person and a nurse) contributes to effective interprofessional working relationships."
  },
  "6.2e": {
    "description": "Apply principles of team leadership and management. performance to improve quality and assure safety."
  },
  "6.2f": {
    "description": "Evaluate performance of individual and team to improve quality and promote safety."
  },
  "6.3a": {
    "description": "Integrate the roles and responsibilities of healthcare professionals through interprofessional collaborative practice."
  },
  "6.3b": {
    "description": "Leverage roles and abilities of team members to optimize care."
  },
  "6.3c": {
    "description": "Communicate with team members to clarify responsibilities in executing plan of care."
  },
  "6.4a": {
    "description": "Demonstrate an awareness of one’s biases and how they may affect mutual respect and communication with team members."
  },
  "6.4b": {
    "description": "Demonstrate respect for the perspectives and experiences of other professions."
  },
  "6.4c": {
    "description": "Engage in constructive communication to facilitate conflict management."
  },
  "6.4d": {
    "description": "Collaborate with interprofessional team members to establish mutual healthcare goals for individuals, communities, or populations."
  },
  "7.1a": {
    "description": "Describe organizational structure, mission, vision, philosophy, and values."
  },
  "7.1b": {
    "description": "Explain the relationships of macrosystems, mesosystems, and microsystems."
  },
  "7.1c": {
    "description": "Differentiate between various healthcare delivery environments across the continuum of care."
  },
  "7.1d": {
    "description": "Recognize internal and external system processes that impact care coordination and transition of care."
  },
  "7.2a": {
    "description": "Describe the financial and payment models of health care."
  },
  "7.2b": {
    "description": "Recognize the impact of health disparities and social determinants of health on care outcomes."
  },
  "7.2c": {
    "description": "Describe the impact of healthcare cost and payment models on the delivery, access, and quality of care."
  },
  "7.2d": {
    "description": "Explain the relationship of policy, regulatory requirements, and economics on care outcomes."
  },
  "7.2e": {
    "description": "Incorporate considerations of efficiency, value, and cost in providing care."
  },
  "7.2f": {
    "description": "Identify the impact of differing system structures, leadership, and workforce needs on care outcomes."
  },
  "7.3a": {
    "description": "Demonstrate a systematic approach for decision-making."
  },
  "7.3b": {
    "description": "Use reported performance metrics to compare/monitor outcomes."
  },
  "7.3c": {
    "description": "Participate in evaluating system effectiveness."
  },
  "7.3d": {
    "description": "Recognize internal and external system processes and structures that perpetuate racism and other forms of discrimination within health care."
  },
  "8.1a": {
    "description": "Identify the variety of information and communication technologies used in care settings."
  },
  "8.1b": {
    "description": "Identify the basic concepts of electronic health, mobile health, and telehealth systems for enabling patient care."
  },
  "8.1c": {
    "description": "Effectively use electronic communication tools."
  },
  "8.1d": {
    "description": "Describe the appropriate use of multimedia applications in health care."
  },
  "8.1e": {
    "description": "Demonstrate best practice use of social networking applications."
  },
  "8.1f": {
    "description": "Explain the importance of nursing engagement in the planning and selection of healthcare technologies."
  },
  "8.2a": {
    "description": "Enter accurate data when chronicling care."
  },
  "8.2b": {
    "description": "Explain how data entered on one patient impacts public and population health data."
  },
  "8.2c": {
    "description": "Use appropriate data when planning care."
  },
  "8.2d": {
    "description": "Demonstrate the appropriate use of health information literacy assessments and improvement strategies."
  },
  "8.2e": {
    "description": "Describe the importance of standardized nursing data to reflect the unique contribution of nursing practice."
  },
  "8.3a": {
    "description": "Demonstrate appropriate use of information and communication technologies."
  },
  "8.3b": {
    "description": "Evaluate how decision support tools impact clinical judgment and safe patient care."
  },
  "8.3c": {
    "description": "Use information and communication technology in a manner that supports the nursepatient relationship."
  },
  "8.3d": {
    "description": "Examine how emerging technologies influence healthcare delivery and clinical decision making."
  },
  "8.3e": {
    "description": "Identify impact of information and communication technology on quality and safety of care."
  },
  "8.3f": {
    "description": "Identify the importance of reporting system processes and functional issues (error messages, mis-directions, device malfunctions, etc.) according to organizational policies and procedures."
  },
  "8.4a": {
    "description": "Explain the role of communication technology in enhancing clinical information flows."
  },
  "8.4b": {
    "description": "Describe how information and communication technology tools support patient and team communications."
  },
  "8.4c": {
    "description": "Identify the basic concepts of electronic health, mobile health, and telehealth systems in enabling patient care."
  },
  "8.4d": {
    "description": "Explain the impact of health information exchange, interoperability, and integration on health care."
  },
  "8.5a": {
    "description": "Identify common risks associated with using information and communication technology"
  },
  "8.5b": {
    "description": "Demonstrate ethical use of social networking applications."
  },
  "8.5c": {
    "description": "Comply with legal and regulatory requirements while using communication and information technologies."
  },
  "8.5d": {
    "description": "Educate patients on their rights to access, review, and correct personal data and medical records."
  },
  "8.5e": {
    "description": "Discuss how clinical judgment and critical thinking must prevail in the presence of information and communication technologies."
  },
  "8.5f": {
    "description": "Deliver care using remote technology."
  },
  "9.1a": {
    "description": "Apply principles of professional nursing ethics and human rights in patient care and professional situations."
  },
  "9.1b": {
    "description": "Reflect on one’s actions and their consequences."
  },
  "9.1c": {
    "description": "Demonstrate ethical behaviors in practice"
  },
  "9.1d": {
    "description": "Change behavior based on self and situational awareness."
  },
  "9.1e": {
    "description": "Report unethical behaviors when observed."
  },
  "9.1f": {
    "description": "Safeguard privacy, confidentiality, and autonomy in all interactions."
  },
  "9.1g": {
    "description": "Advocate for the individual’s right to self-determination."
  },
  "9.2a": {
    "description": "Employ the use of intentional presence to facilitate shared meaning of the experience between nurse and recipient of care."
  },
  "9.2b": {
    "description": "Facilitate health and healing through compassionate caring."
  },
  "9.2c": {
    "description": "Demonstrate empathy to the individual’s life experience."
  },
  "9.2d": {
    "description": "Advocate for practices that advance diversity, equity, and inclusion."
  },
  "9.2e": {
    "description": "Demonstrate cultural sensitivity and humility in practice."
  },
  "9.2f": {
    "description": "Apply principles of therapeutic relationships and professional boundaries."
  },
  "9.2g": {
    "description": "Communicate in a professional manner"
  },
  "9.3a": {
    "description": "Engage in advocacy that promotes the best interest of the individual, community, and profession."
  },
  "9.3b": {
    "description": "Demonstrate the moral courage to report concerns related to actual or potential hazards and/ or errors."
  },
  "9.3c": {
    "description": "Demonstrate professional and personal honesty and integrity."
  },
  "9.3d": {
    "description": "Take responsibility for one’s roles, decisions, obligations, actions, and care outcomes."
  },
  "9.3e": {
    "description": "Engage in professional activities and/or organizations."
  },
  "9.3f": {
    "description": "Demonstrate adherence to a culture of civility."
  },
  "9.3g": {
    "description": "Advocate for social justice and health equity, including addressing the health of vulnerable populations."
  },
  "9.3h": {
    "description": "Engage in peer evaluation."
  },
  "9.4a": {
    "description": "Advocate for policies that promote health and prevent harm."
  },
  "9.4b": {
    "description": "Adhere to the registered nurse scope and standards of practice."
  },
  "9.4c": {
    "description": "Adhere to regulatory requirements and workplace policies consistent with one’s educational preparation."
  },
  "9.5a": {
    "description": "Describe nursing’s professional identity and contributions to the healthcare team."
  },
  "9.5b": {
    "description": "Demonstrate the core values of professional nursing identity."
  },
  "9.5c": {
    "description": "Demonstrate sensitivity to the values of others."
  },
  "9.5d": {
    "description": "Demonstrate ethical comportment and moral courage in decision making and actions."
  },
  "9.5e": {
    "description": "Demonstrate emotional intelligence."
  },
  "9.6a": {
    "description": "Demonstrate respect for diverse individual differences and diverse communities and populations."
  },
  "9.6b": {
    "description": "Demonstrate awareness of personal and professional values and conscious and unconscious biases."
  },
  "9.6c": {
    "description": "Integrate core principles of social justice and human rights into practice."
  },
  "10.1a": {
    "description": "Demonstrate healthy, self-care behaviors that promote wellness and resiliency."
  },
  "10.1b": {
    "description": "Manage conflict between personal and professional responsibilities."
  },
  "10.2a": {
    "description": "Engage in guided and spontaneous reflection of one’s practice."
  },
  "10.2b": {
    "description": "b Integrate comprehensive feedback to improve performance."
  },
  "10.2c": {
    "description": "Commit to personal and professional development."
  },
  "10.2d": {
    "description": "Expand personal knowledge to inform clinical judgment."
  },
  "10.2e": {
    "description": "Participate in ongoing activities that embrace principles of diversity, equity, inclusion, and antidiscrimination."
  },
  "10.3a": {
    "description": "Compare and contrast leadership principles and theories."
  },
  "10.3b": {
    "description": "Formulate a personal leadership style."
  },
  "10.3c": {
    "description": "Demonstrate leadership behaviors in professional situations."
  },
  "10.3d": {
    "description": "Demonstrate self-efficacy consistent with one’s professional development."
  },
  "10.3e": {
    "description": "Use appropriate resources when dealing with ambiguity."
  },
  "10.3f": {
    "description": "Modify one’s own leadership behaviors based on guided self-reflection."
  },
  "10.3g": {
    "description": "Demonstrate self-awareness of one’s own implicit biases and their relationship to one’s culture and environment."
  },
  "10.3h": {
    "description": "Communicate a consistent image of the nurse as a leader."
  },
  "10.3i": {
    "description": "Recognize the importance of nursing’s contributions as leaders in practice and policy issues."
  }
}
