{
  "subCompetencies": {
    "1.1a": {
      "description": "Identify concepts, derived from theories from nursing and other disciplines, which distinguish the practice of nursing.",
      "progressionIndicators": {
        "Developing": [
          "Describe fundamental nursing theories and concepts that differentiate nursing from other healthcare disciplines.",
          "Explain how theoretical concepts guide practice."
        ],
        "Developed": [
          "Explain nursing and interdisciplinary theories, highlighting their contributions to nursing practice and identifying how they distinguish nursing from other healthcare professions.",
          "Develop and implement plans of care that integrate theoretical concepts from nursing and other relevant disciplines."
        ]
      }
    },
    "1.1b": {
      "description": "Apply knowledge of nursing science that develops a foundation for nursing practice.",
      "progressionIndicators": {
        "Developing": [
          "Discuss relevant research findings and their application in supporting nursing interventions."
        ],
        "Developed": [
          "Integrate nursing science into clinical decision-making by accurately assessing patient conditions and formulating evidence-based plans of care."
        ]
      }
    },
    "1.1c": {
      "description": "Understand the historical foundation of nursing as the relationship developed between the individual and nurse.",
      "progressionIndicators": {
        "Developing": [
          "Discuss the impact of key historical figures and their contributions to developing the nursing relationship.",
          "Describe major historical events influencing nursing's evolution and how these events have shaped current nurse-patient interactions."
        ],
        "Developed": [
          "Incorporate parallels between historical nursing practices and contemporary approaches to patient care and practice situations."
        ]
      }
    },
    "1.1d": {
      "description": "Articulate nursing's distinct perspective to practice.",
      "progressionIndicators": {
        "Developing": [
          "Identify core nursing values and explain how they shape the nursing approach, distinguishing it from other health professions.",
          "Explain how empathy, active listening, and culturally responsive care foster a deeper nursing-patient connection."
        ],
        "Developed": [
          "Explain how nursing's emphasis on holistic care differentiates it from other healthcare disciplines.",
          "Apply current, peer-reviewed nursing science and evidence-based practice guidelines to justify and inform nursing practice.",
          "Employ empathy, active listening, and culturally responsive care while interacting with patients."
        ]
      }
    }
  }
}
